MikroElektronika/core_packages/ARM/gcc_clang/system/src/nuvoton/m252/thirdparty/m252/gpio_reg.h
#define GPIO_PUSEL_PUSEL6_Pos            (12)                                              /*!< GPIO_T::PUSEL: PUSEL6 Position         */
#define GPIO_PUSEL_PUSEL6_Msk            (0x3ul << GPIO_PUSEL_PUSEL6_Pos)                  /*!< GPIO_T::PUSEL: PUSEL6 Mask             */

#define GPIO_PUSEL_PUSEL7_Pos            (14)                                              /*!< GPIO_T::PUSEL: PUSEL7 Position         */
#define GPIO_PUSEL_PUSEL7_Msk            (0x3ul << GPIO_PUSEL_PUSEL7_Pos)                  /*!< GPIO_T::PUSEL: PUSEL7 Mask             */

#define GPIO_PUSEL_PUSEL8_Pos            (16)                                              /*!< GPIO_T::PUSEL: PUSEL8 Position         */
#define GPIO_PUSEL_PUSEL8_Msk            (0x3ul << GPIO_PUSEL_PUSEL8_Pos)                  /*!< GPIO_T::PUSEL: PUSEL8 Mask             */

#define GPIO_PUSEL_PUSEL9_Pos            (18)                                              /*!< GPIO_T::PUSEL: PUSEL9 Position         */
#define GPIO_PUSEL_PUSEL9_Msk            (0x3ul << GPIO_PUSEL_PUSEL9_Pos)                  /*!< GPIO_T::PUSEL: PUSEL9 Mask             */

#define GPIO_PUSEL_PUSEL10_Pos           (20)                                              /*!< GPIO_T::PUSEL: PUSEL10 Position        */
#define GPIO_PUSEL_PUSEL10_Msk           (0x3ul << GPIO_PUSEL_PUSEL10_Pos)                 /*!< GPIO_T::PUSEL: PUSEL10 Mask            */

#define GPIO_PUSEL_PUSEL11_Pos           (22)                                              /*!< GPIO_T::PUSEL: PUSEL11 Position        */
#define GPIO_PUSEL_PUSEL11_Msk           (0x3ul << GPIO_PUSEL_PUSEL11_Pos)                 /*!< GPIO_T::PUSEL: PUSEL11 Mask            */

#define GPIO_PUSEL_PUSEL12_Pos           (24)                                              /*!< GPIO_T::PUSEL: PUSEL12 Position        */
#define GPIO_PUSEL_PUSEL12_Msk           (0x3ul << GPIO_PUSEL_PUSEL12_Pos)                 /*!< GPIO_T::PUSEL: PUSEL12 Mask            */

#define GPIO_PUSEL_PUSEL13_Pos           (26)                                              /*!< GPIO_T::PUSEL: PUSEL13 Position        */
#define GPIO_PUSEL_PUSEL13_Msk           (0x3ul << GPIO_PUSEL_PUSEL13_Pos)                 /*!< GPIO_T::PUSEL: PUSEL13 Mask            */

#define GPIO_PUSEL_PUSEL14_Pos           (28)                                              /*!< GPIO_T::PUSEL: PUSEL14 Position        */
#define GPIO_PUSEL_PUSEL14_Msk           (0x3ul << GPIO_PUSEL_PUSEL14_Pos)                 /*!< GPIO_T::PUSEL: PUSEL14 Mask            */

#define GPIO_PUSEL_PUSEL15_Pos           (30)                                              /*!< GPIO_T::PUSEL: PUSEL15 Position        */
#define GPIO_PUSEL_PUSEL15_Msk           (0x3ul << GPIO_PUSEL_PUSEL15_Pos)                 /*!< GPIO_T::PUSEL: PUSEL15 Mask            */

#define GPIO_DBCTL_DBCLKSEL_Pos          (0)                                               /*!< GPIO_T::DBCTL: DBCLKSEL Position       */
#define GPIO_DBCTL_DBCLKSEL_Msk          (0xful << GPIO_DBCTL_DBCLKSEL_Pos)                /*!< GPIO_T::DBCTL: DBCLKSEL Mask           */

#define GPIO_DBCTL_DBCLKSRC_Pos          (4)                                               /*!< GPIO_T::DBCTL: DBCLKSRC Position       */
#define GPIO_DBCTL_DBCLKSRC_Msk          (0x1ul << GPIO_DBCTL_DBCLKSRC_Pos)                /*!< GPIO_T::DBCTL: DBCLKSRC Mask           */

#define GPIO_DBCTL_ICLKONA_Pos          (16)                                               /*!< GPIO_T::DBCTL: ICLKONA Position        */
#define GPIO_DBCTL_ICLKONA_Msk          (0x1ul << GPIO_DBCTL_ICLKONA_Pos)                  /*!< GPIO_T::DBCTL: ICLKONA Mask            */

#define GPIO_DBCTL_ICLKONB_Pos          (17)                                               /*!< GPIO_T::DBCTL: ICLKONB Position        */
#define GPIO_DBCTL_ICLKONB_Msk          (0x1ul << GPIO_DBCTL_ICLKONB_Pos)                  /*!< GPIO_T::DBCTL: ICLKONB Mask            */

#define GPIO_DBCTL_ICLKONC_Pos          (18)                                               /*!< GPIO_T::DBCTL: ICLKONC Position        */
#define GPIO_DBCTL_ICLKONC_Msk          (0x1ul << GPIO_DBCTL_ICLKONC_Pos)                  /*!< GPIO_T::DBCTL: ICLKONC Mask            */

#define GPIO_DBCTL_ICLKOND_Pos          (19)                                               /*!< GPIO_T::DBCTL: ICLKOND Position        */
#define GPIO_DBCTL_ICLKOND_Msk          (0x1ul << GPIO_DBCTL_ICLKOND_Pos)                  /*!< GPIO_T::DBCTL: ICLKOND Mask            */

#define GPIO_DBCTL_ICLKONE_Pos          (20)                                               /*!< GPIO_T::DBCTL: ICLKONE Position        */
#define GPIO_DBCTL_ICLKONE_Msk          (0x1ul << GPIO_DBCTL_ICLKONE_Pos)                  /*!< GPIO_T::DBCTL: ICLKONE Mask            */

#define GPIO_DBCTL_ICLKONF_Pos          (21)                                               /*!< GPIO_T::DBCTL: ICLKONF Position        */
#define GPIO_DBCTL_ICLKONF_Msk          (0x1ul << GPIO_DBCTL_ICLKONF_Pos)                  /*!< GPIO_T::DBCTL: ICLKONF Mask            */


/** @} GPIO_CONST */
/** @} end of GPIO register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __GPIO_REG_H__ */
